micropython/micropython/ports/psoc-edge/boards/KIT_PSE84_AI/bsp-cfg/cycfg_system.c
const cy_en_prot_region_t cycfg_unused_ppc_1_regions[] =
{
    PROT_PERI1_MAIN,
    PROT_PERI1_GR0_GROUP,
    PROT_PERI1_GR1_GROUP,
    PROT_PERI1_GR2_GROUP,
    PROT_PERI1_GR3_GROUP,
    PROT_PERI1_GR4_GROUP,
    PROT_PERI1_GR0_BOOT,
    PROT_PERI1_GR1_BOOT,
    PROT_PERI1_GR2_BOOT,
    PROT_PERI1_GR3_BOOT,
    PROT_PERI1_GR4_BOOT,
    PROT_PERI1_TR,
    PROT_PERI1_PERI_PCLK1_MAIN,
    PROT_PERI1_M55APPCPUSS,
    PROT_PERI1_MXCM55_CM55,
    PROT_PERI1_MXCM55_CM55_S,
    PROT_PERI1_MXCM55_CM55_NS,
    PROT_PERI1_MXCM55_BOOT,
    PROT_PERI1_MXCM55_CM55_INT,
    PROT_PERI1_SAXI_DMAC_TOP,
    PROT_PERI1_SAXI_DMAC_CH0_CH,
    PROT_PERI1_SAXI_DMAC_CH1_CH,
    PROT_PERI1_SAXI_DMAC_CH2_CH,
    PROT_PERI1_SAXI_DMAC_CH3_CH,
    PROT_PERI1_APPCPUSS_ALL_PC,
    PROT_PERI1_APPCPUSS_CM33_NS,
    PROT_PERI1_APPCPUSS_MSC_INT,
    PROT_PERI1_APPCPUSS_AHB2AXI_INT,
    PROT_PERI1_APPCPUSS_AP,
    PROT_PERI1_MS_CTL_MS13_MAIN,
    PROT_PERI1_MS_CTL_MS14_MAIN,
    PROT_PERI1_MS_CTL_MS15_MAIN,
    PROT_PERI1_MS_CTL_MS19_MAIN,
    PROT_PERI1_MS_CTL_MS23_MAIN,
    PROT_PERI1_MS_CTL_MS25_MAIN,
    PROT_PERI1_MS_CTL_MS26_MAIN,
    PROT_PERI1_MS_CTL_MS27_MAIN,
    PROT_PERI1_MS_CTL_MS28_MAIN,
    PROT_PERI1_MS_CTL_MS_PC13_PRIV,
    PROT_PERI1_MS_CTL_MS_PC14_PRIV,
    PROT_PERI1_MS_CTL_MS_PC15_PRIV,
    PROT_PERI1_MS_CTL_MS_PC19_PRIV,
    PROT_PERI1_MS_CTL_MS_PC25_PRIV,
    PROT_PERI1_MS_CTL_MS_PC26_PRIV,
    PROT_PERI1_MS_CTL_MS_PC27_PRIV,
    PROT_PERI1_MS_CTL_MS_PC28_PRIV,
    PROT_PERI1_MS_CTL_MS_PC13_PRIV_MIR,
    PROT_PERI1_MS_CTL_MS_PC14_PRIV_MIR,
    PROT_PERI1_MS_CTL_MS_PC15_PRIV_MIR,
    PROT_PERI1_MS_CTL_MS_PC19_PRIV_MIR,
    PROT_PERI1_MS_CTL_MS_PC25_PRIV_MIR,
    PROT_PERI1_MS_CTL_MS_PC26_PRIV_MIR,
    PROT_PERI1_MS_CTL_MS_PC27_PRIV_MIR,
    PROT_PERI1_MS_CTL_MS_PC28_PRIV_MIR,
    PROT_PERI1_MS_CTL_MSC_ACG,
    PROT_PERI1_APPCPUSS_SL_CTL_GROUP,
    PROT_PERI1_IPC1_STRUCT0_IPC,
    PROT_PERI1_IPC1_STRUCT1_IPC,
    PROT_PERI1_IPC1_STRUCT2_IPC,
    PROT_PERI1_IPC1_STRUCT3_IPC,
    PROT_PERI1_IPC1_STRUCT4_IPC,
    PROT_PERI1_IPC1_STRUCT5_IPC,
    PROT_PERI1_IPC1_STRUCT6_IPC,
    PROT_PERI1_IPC1_STRUCT7_IPC,
    PROT_PERI1_IPC1_STRUCT8_IPC,
    PROT_PERI1_IPC1_STRUCT9_IPC,
    PROT_PERI1_IPC1_STRUCT10_IPC,
    PROT_PERI1_IPC1_STRUCT11_IPC,
    PROT_PERI1_IPC1_STRUCT12_IPC,
    PROT_PERI1_IPC1_STRUCT13_IPC,
    PROT_PERI1_IPC1_STRUCT14_IPC,
    PROT_PERI1_IPC1_STRUCT15_IPC,
    PROT_PERI1_IPC1_INTR_STRUCT0_INTR,
    PROT_PERI1_IPC1_INTR_STRUCT1_INTR,
    PROT_PERI1_IPC1_INTR_STRUCT2_INTR,
    PROT_PERI1_IPC1_INTR_STRUCT3_INTR,
    PROT_PERI1_IPC1_INTR_STRUCT4_INTR,
    PROT_PERI1_IPC1_INTR_STRUCT5_INTR,
    PROT_PERI1_IPC1_INTR_STRUCT6_INTR,
    PROT_PERI1_IPC1_INTR_STRUCT7_INTR,
    PROT_PERI1_PDM0_MAIN,
    PROT_PERI1_PDM0_CH0_RX,
    PROT_PERI1_PDM0_CH1_RX,
    PROT_PERI1_PDM0_CH2_RX,
    PROT_PERI1_PDM0_CH3_RX,
    PROT_PERI1_PDM0_CH4_RX,
    PROT_PERI1_PDM0_CH5_RX,
    PROT_PERI1_TDM0_TDM_STRUCT0_TDM_TX_STRUCT_TX,
    PROT_PERI1_TDM0_TDM_STRUCT1_TDM_TX_STRUCT_TX,
    PROT_PERI1_TDM0_TDM_STRUCT0_TDM_RX_STRUCT_RX,
    PROT_PERI1_TDM0_TDM_STRUCT1_TDM_RX_STRUCT_RX,
    PROT_PERI1_SMIF0_CACHE_BLOCK_MAIN,
    PROT_PERI1_SMIF1_CACHE_BLOCK_MAIN,
    PROT_PERI1_SMIF0_CACHE_BLOCK_MMIO_MAIN,
    PROT_PERI1_SMIF1_CACHE_BLOCK_MMIO_MAIN,
    PROT_PERI1_SMIF0_CACHE_BLOCK_CACHEBLK_AHB_MPC0_PPC_MPC_MAIN,
    PROT_PERI1_SMIF1_CACHE_BLOCK_CACHEBLK_AHB_MPC0_PPC_MPC_MAIN,
    PROT_PERI1_SMIF0_CACHE_BLOCK_CACHEBLK_AHB_MPC0_PPC_MPC_PC,
    PROT_PERI1_SMIF1_CACHE_BLOCK_CACHEBLK_AHB_MPC0_PPC_MPC_PC,
    PROT_PERI1_SMIF0_CACHE_BLOCK_CACHEBLK_AHB_MPC0_PPC_MPC_ROT,
    PROT_PERI1_SMIF1_CACHE_BLOCK_CACHEBLK_AHB_MPC0_PPC_MPC_ROT,
    PROT_PERI1_SMIF0_CORE_MAIN,
    PROT_PERI1_SMIF1_CORE_MAIN,
    PROT_PERI1_SMIF0_CORE_CRYPTO,
    PROT_PERI1_SMIF1_CORE_CRYPTO,
    PROT_PERI1_SMIF0_CORE_MAIN2,
    PROT_PERI1_SMIF1_CORE_MAIN2,
    PROT_PERI1_SMIF0_CORE_DEVICE,
    PROT_PERI1_SMIF1_CORE_DEVICE,
    PROT_PERI1_SMIF0_CORE_AXI_MPC0_PPC_MPC_MAIN,
    PROT_PERI1_SMIF1_CORE_AXI_MPC0_PPC_MPC_MAIN,
    PROT_PERI1_SMIF0_CORE_AXI_MPC0_PPC_MPC_PC,
    PROT_PERI1_SMIF1_CORE_AXI_MPC0_PPC_MPC_PC,
    PROT_PERI1_SMIF0_CORE_AXI_MPC0_PPC_MPC_ROT,
    PROT_PERI1_SMIF1_CORE_AXI_MPC0_PPC_MPC_ROT,
    PROT_PERI1_SMIF0_CORE_SMIF_HSIOM_SMIF_PRT0_PRT,
    PROT_PERI1_SMIF0_CORE_SMIF_HSIOM_SMIF_PRT1_PRT,
    PROT_PERI1_SMIF0_CORE_SMIF_HSIOM_SMIF_PRT2_PRT,
    PROT_PERI1_SMIF1_CORE_SMIF_HSIOM_SMIF_PRT0_PRT,
    PROT_PERI1_SMIF1_CORE_SMIF_HSIOM_SMIF_PRT1_PRT,
    PROT_PERI1_SMIF1_CORE_SMIF_HSIOM_SMIF_PRT2_PRT,
    PROT_PERI1_SMIF0_CORE_SMIF_HSIOM_MON,
    PROT_PERI1_SMIF1_CORE_SMIF_HSIOM_MON,
    PROT_PERI1_SMIF0_CORE_SMIF_GPIO_SMIF_PRT0_PRT,
    PROT_PERI1_SMIF0_CORE_SMIF_GPIO_SMIF_PRT1_PRT,
    PROT_PERI1_SMIF0_CORE_SMIF_GPIO_SMIF_PRT2_PRT,
    PROT_PERI1_SMIF1_CORE_SMIF_GPIO_SMIF_PRT0_PRT,
    PROT_PERI1_SMIF1_CORE_SMIF_GPIO_SMIF_PRT1_PRT,
    PROT_PERI1_SMIF1_CORE_SMIF_GPIO_SMIF_PRT2_PRT,
    PROT_PERI1_SMIF0_CORE_SMIF_GPIO_SMIF_PRT0_CFG,
    PROT_PERI1_SMIF0_CORE_SMIF_GPIO_SMIF_PRT1_CFG,
    PROT_PERI1_SMIF0_CORE_SMIF_GPIO_SMIF_PRT2_CFG,
    PROT_PERI1_SMIF1_CORE_SMIF_GPIO_SMIF_PRT0_CFG,
    PROT_PERI1_SMIF1_CORE_SMIF_GPIO_SMIF_PRT1_CFG,
    PROT_PERI1_SMIF1_CORE_SMIF_GPIO_SMIF_PRT2_CFG,
    PROT_PERI1_SMIF0_CORE_SMIF_GPIO_GPIO,
    PROT_PERI1_SMIF1_CORE_SMIF_GPIO_GPIO,
    PROT_PERI1_SMIF0_CORE_SMIF_GPIO_TEST,
    PROT_PERI1_SMIF1_CORE_SMIF_GPIO_TEST,
    PROT_PERI1_U550_U55,
    PROT_PERI1_U550_ROT,
    PROT_PERI1_U550_ACG,
    PROT_PERI1_U550_MXU55_PPU_PPU,
    PROT_PERI1_U550_PD_PD,
    PROT_PERI1_SOCMEM_MAIN,
    PROT_PERI1_SOCMEM_BOOT,
    PROT_PERI1_SOCMEM_SOCMEM_PWR,
    PROT_PERI1_SOCMEM_SRAM_MPC0_PPC_MPC_MAIN,
    PROT_PERI1_SOCMEM_SRAM_MPC0_PPC_MPC_PC,
    PROT_PERI1_SOCMEM_SRAM_MPC0_PPC_MPC_ROT,
    PROT_PERI1_SOCMEM_MAIN_PORT,
    PROT_PERI1_SOCMEM_PPU_SOCMEM_PPU,
    PROT_PERI1_SOCMEM_SOCMEM_PD_PD,
    PROT_PERI1_GFXSS_GPU_GFXSS,
    PROT_PERI1_GFXSS_DC_GFXSS,
    PROT_PERI1_GFXSS_MIPIDSI_GFXSS,
    PROT_PERI1_SDHC0,
    PROT_PERI1_SDHC1,
    PROT_PERI1_USBHS_DWC_otg_intreg_CONTROLLER,
    PROT_PERI1_USBHS_SS_SUBSYSTEM,
    PROT_PERI1_ITCM,
    PROT_PERI1_DTCM,
};
const size_t cycfg_unused_ppc_0_regions_count = sizeof(cycfg_unused_ppc_0_regions) / sizeof(cy_en_prot_region_t);
const size_t cycfg_unused_ppc_1_regions_count = sizeof(cycfg_unused_ppc_1_regions) / sizeof(cy_en_prot_region_t);

