micropython/micropython/ports/psoc-edge/boards/KIT_PSE84_AI/bsp-cfg/cycfg_system.c
#if defined(CY_PDL_TZ_ENABLED)
const cy_stc_sau_config_t SAU_config[4] =
{
    {
        .reg_num = 0U,
        .base_addr = 0x00000000,
        .size = 0x10000000,
        .nsc = false,
    },
    {
        .reg_num = 1U,
        .base_addr = 0x20000000,
        .size = 0x10000000,
        .nsc = false,
    },
    {
        .reg_num = 2U,
        .base_addr = 0x40000000,
        .size = 0xc0000000,
        .nsc = false,
    },
    {
        .reg_num = 3,
        .base_addr = NSC_START_ADDRESS,
        .size = NSC_SIZE,
        .nsc = true,
    },
};
#endif /* defined(CY_PDL_TZ_ENABLED) */

const cy_stc_mpu_config_t cycfg_mpu_cm55_ns_0_config[3] =
{
    {
        .reg_num = 1U,
        .base_addr = 0x240FD000,
        .end_addr = 0x240FFFFF,
        .writable = true,
        .require_privileged = false,
        .shareable = false,
        .executable = false,
        .cacheable = 4,
        .is_device = false,
        .device_attrs = 0,
    },
    {
        .reg_num = 2U,
        .base_addr = 0x262FC000,
        .end_addr = 0x2633BFFF,
        .writable = true,
        .require_privileged = false,
        .shareable = false,
        .executable = false,
        .cacheable = 4,
        .is_device = false,
        .device_attrs = 0,
    },
    {
        .reg_num = 3U,
        .base_addr = 0x2633C000,
        .end_addr = 0x264FFFFF,
        .writable = true,
        .require_privileged = false,
        .shareable = false,
        .executable = false,
        .cacheable = 4,
        .is_device = false,
        .device_attrs = 0,
    },
};

#if defined(COMPONENT_SECURE_DEVICE) && defined(COMPONENT_MW_MTB_SRF)
const mtb_srf_protection_range_s_t mxrramc_0_mpc_0_srf_protection_range_s[mxrramc_0_mpc_0_REGION_COUNT] =
{
    {
        .start = (void *)0x22011000,
        .length = 0x4A000U,
        .is_secure = true,
    },
    {
        .start = (void *)0x2205B000,
        .length = 0x8000U,
        .is_secure = false,
    },
};
const mtb_srf_protection_range_s_t mxsramc_0_mpc_0_srf_protection_range_s[mxsramc_0_mpc_0_REGION_COUNT] =
{
    {
        .start = (void *)0x24001000,
        .length = 0x57000U,
        .is_secure = true,
    },
    {
        .start = (void *)0x24058000,
        .length = 0x28000U,
        .is_secure = false,
    },
};
const mtb_srf_protection_range_s_t mxsramc_1_mpc_0_srf_protection_range_s[mxsramc_1_mpc_0_REGION_COUNT] =
{
    {
        .start = (void *)0x24080000,
        .length = 0x3D000U,
        .is_secure = false,
    },
    {
        .start = (void *)0x240BD000,
        .length = 0x43000U,
        .is_secure = false,
    },
};
const mtb_srf_protection_range_s_t smif_0_mpc_0_srf_protection_range_s[smif_0_mpc_0_REGION_COUNT] =
{
    {
        .start = (void *)0x60100000,
        .length = 0x240000U,
        .is_secure = true,
    },
    {
        .start = (void *)0x60340000,
        .length = 0x240000U,
        .is_secure = false,
    },
    {
        .start = (void *)0x60580000,
        .length = 0x300000U,
        .is_secure = false,
    },
    {
        .start = (void *)0x60100000,
        .length = 0x240000U,
        .is_secure = true,
    },
    {
        .start = (void *)0x60340000,
        .length = 0x240000U,
        .is_secure = false,
    },
    {
        .start = (void *)0x60580000,
        .length = 0x300000U,
        .is_secure = false,
    },
};
const mtb_srf_protection_range_s_t socmem_0_mpc_0_srf_protection_range_s[socmem_0_mpc_0_REGION_COUNT] =
{
    {
        .start = (void *)0x26000000,
        .length = 0x40000U,
        .is_secure = false,
    },
    {
        .start = (void *)0x26040000,
        .length = 0x4C0000U,
        .is_secure = false,
    },
};
#endif /* defined(COMPONENT_SECURE_DEVICE) && defined(COMPONENT_MW_MTB_SRF) */

#if defined(CY_PDL_TZ_ENABLED)
cy_rslt_t _cycfg_mpc_init_regions_rram(const cy_stc_mpc_regions_t *region, const cy_stc_mpc_rot_cfg_t *cfg, uint8_t cfg_count);
cy_rslt_t _cycfg_mpc_init_regions(const cy_stc_mpc_regions_t *region, const cy_stc_mpc_rot_cfg_t *config, uint8_t cfg_count);
#endif /* defined(CY_PDL_TZ_ENABLED) */

cy_rslt_t cycfg_ppc_init_unsecure(PPC_Type *base, const cy_en_prot_region_t regions[], size_t count);

void init_cycfg_ns_power(void) {
    /* Update global variables used by DeepSleep functions */
    #if (CY_CFG_PWR_SYS_IDLE_MODE == CY_CFG_PWR_MODE_DEEPSLEEP)
    Cy_SysPm_DeepSleepSetup(CY_SYSPM_MODE_DEEPSLEEP);
    #elif (CY_CFG_PWR_SYS_IDLE_MODE == CY_CFG_PWR_MODE_DEEPSLEEP_RAM)
    Cy_SysPm_DeepSleepSetup(CY_SYSPM_MODE_DEEPSLEEP_RAM);
    #elif (CY_CFG_PWR_SYS_IDLE_MODE == CY_CFG_PWR_MODE_DEEPSLEEP_OFF)
    Cy_SysPm_DeepSleepSetup(CY_SYSPM_MODE_DEEPSLEEP_OFF);
    #endif /* CY_CFG_PWR_SYS_IDLE_MODE */

}
void init_cycfg_power(void) {
    Cy_SysPm_Init();

    /* **System Active Power Mode Profile Configuration** */
    #if (CY_CFG_PWR_SYS_ACTIVE_PROFILE == CY_CFG_PWR_MODE_HP)
    Cy_SysPm_SystemEnterHp();
    #elif (CY_CFG_PWR_SYS_ACTIVE_PROFILE == CY_CFG_PWR_MODE_ULP)
    Cy_SysPm_SystemEnterUlp();
    #elif (CY_CFG_PWR_SYS_ACTIVE_PROFILE == CY_CFG_PWR_MODE_LP)
    Cy_SysPm_SystemEnterLp();
    #endif    /* CY_CFG_PWR_SYS_IDLE_MODE */

    /* **System Domain Idle Power Mode Configuration** */
    #if (CY_CFG_PWR_SYS_IDLE_MODE == CY_CFG_PWR_MODE_DEEPSLEEP)
    Cy_SysPm_SetDeepSleepMode(CY_SYSPM_MODE_DEEPSLEEP);
    Cy_SysPm_SetAppDeepSleepMode(CY_SYSPM_MODE_DEEPSLEEP);
    #elif (CY_CFG_PWR_SYS_IDLE_MODE == CY_CFG_PWR_MODE_DEEPSLEEP_RAM)
    Cy_SysPm_SetDeepSleepMode(CY_SYSPM_MODE_DEEPSLEEP_RAM);
    Cy_SysPm_SetAppDeepSleepMode(CY_SYSPM_MODE_DEEPSLEEP_RAM);
    #elif (CY_CFG_PWR_SYS_IDLE_MODE == CY_CFG_PWR_MODE_DEEPSLEEP_OFF)
    Cy_SysPm_SetDeepSleepMode(CY_SYSPM_MODE_DEEPSLEEP_OFF);
    Cy_SysPm_SetAppDeepSleepMode(CY_SYSPM_MODE_DEEPSLEEP_OFF);
    #endif    /* CY_CFG_PWR_SYS_IDLE_MODE */


    Cy_SysPm_DeepSleepUpdate();

    /* **Power domains Configuration** */
    #if (CY_CFG_PWR_PD1_DOMAIN)
    #if defined(CORE_NAME_CM33_0) && defined(CY_PDL_TZ_ENABLED)
    /* Enables PD1 power domain */
    Cy_System_EnablePD1();
    /* Enables APP_MMIO_TCM memory for CM55 core */
    Cy_SysClk_PeriGroupSlaveInit(CY_MMIO_CM55_TCM_512K_PERI_NR, CY_MMIO_CM55_TCM_512K_GROUP_NR, \
        CY_MMIO_CM55_TCM_512K_SLAVE_NR, CY_MMIO_CM55_TCM_512K_CLK_HF_NR);

    /* Clear SYSCPU and APPCPU power domain dependency set by boot code */
    cy_pd_pdcm_clear_dependency(CY_PD_PDCM_APPCPU, CY_PD_PDCM_SYSCPU);

