micropython/micropython/ports/psoc-edge/boards/KIT_PSE84_AI/bsp-cfg/cycfg_system.c
    #endif        /* defined(CORE_NAME_CM33_0) && defined(CY_PDL_TZ_ENABLED) */
    #endif    /* (CY_CFG_PWR_PD1_DOMAIN) */
}

#if defined(CY_PDL_TZ_ENABLED)
cy_rslt_t _cycfg_mpc_init_regions_rram(const cy_stc_mpc_regions_t *region, const cy_stc_mpc_rot_cfg_t *cfg, uint8_t cfg_count) {
    cy_rslt_t result = CY_RSLT_SUCCESS;
    ifx_se_mpc_rot_cfg_t rotConfigRram;
    ifx_se_mpc_rot_cfg_crc_t rotConfigCrcRram;

    memset((void *)&rotConfigRram, 0, sizeof(ifx_se_mpc_rot_cfg_t));
    memset((void *)&rotConfigCrcRram, 0, sizeof(ifx_se_mpc_rot_cfg_crc_t));

    // Set up rotConfig based on region
    rotConfigRram.addr_offset = region->offset;
    rotConfigRram.size = region->size;
    rotConfigRram.region_size = IFX_SE_MPC_SIZE_4KB;

    for (uint32_t cfg_idx = 0; cfg_idx < cfg_count; ++cfg_idx)
    {
        rotConfigRram.pc = (ifx_se_mpc_prot_context_t)cfg[cfg_idx].pc;
        rotConfigRram.secure = (ifx_se_mpc_sec_attr_t)cfg[cfg_idx].secure;
        rotConfigRram.access = (ifx_se_mpc_access_attr_t)cfg[cfg_idx].access;
        rotConfigCrcRram.mpc_config = rotConfigRram;
        rotConfigCrcRram.crc =
            IFX_CRC32_CALC((uint8_t *)(&rotConfigCrcRram), sizeof(rotConfigCrcRram) - sizeof(uint32_t));
        // Call the configuration function for each region and config
        ifx_se_status_t cfg_rslt = ifx_se_mpc_config_rot_mpc_struct(&rotConfigCrcRram,
            IFX_SE_NULL_CTX);

        if (!IFX_SE_IS_STATUS_SUCCESS(cfg_rslt)) {
            result = CY_MPC_FAILURE;
        }
    }

    return result;
}
cy_rslt_t _cycfg_mpc_init_regions(const cy_stc_mpc_regions_t *region, const cy_stc_mpc_rot_cfg_t *config, uint8_t cfg_count) {
    // Will return an error if one occurs at all in the setup process
    cy_rslt_t retResult = CY_RSLT_SUCCESS;
    // Will track the current iteration for errors
    cy_rslt_t currentResult = CY_RSLT_SUCCESS;

    for (uint32_t cfg_idx = 0; cfg_idx < cfg_count; ++cfg_idx)
    {
        // Call the configuration function for each region and config
        currentResult = Cy_Mpc_ConfigRotMpcStruct(region->base, region->offset, region->size,  &config[cfg_idx]);
        if (CY_RSLT_SUCCESS != currentResult) {
            retResult = currentResult;
        }
    }

    return retResult;
}
cy_rslt_t init_cycfg_mpc(void) {
    // Will return an error if one occurs at all in the setup process
    cy_rslt_t retResult = CY_RSLT_SUCCESS;
    // Will track the current iteration for errors
    cy_rslt_t currentResult = CY_RSLT_SUCCESS;

    // When executing from RRAM, the SMIF must be initialized and enabled to
    // hold onto any MPC configurations performed on the SMIF memory regions.
    // We can disable them after performing the MPC configurations.
    #if (smif_0_mpc_0_REGION_COUNT > 0U)
    bool isSmif0Uninitialized = false;
    if (!Cy_SMIF_IsEnabled(SMIF0_CORE)) {
        isSmif0Uninitialized = true;

        cy_stc_smif_context_t SMIF_CORE0_Context;

        static const cy_stc_smif_config_t SMIF_0_CORE_0_config =
        {
            .mode = (uint32_t)CY_SMIF_NORMAL,
            .deselectDelay = SMIF_DESELECT_DELAY,
            .blockEvent = (uint32_t)CY_SMIF_BUS_ERROR,
            .enable_internal_dll = false
        };

        /* Enable IP with default configuration */
        (void)Cy_SMIF_Init(SMIF0_CORE, &SMIF_0_CORE_0_config, TIMEOUT_1_MS, &SMIF_CORE0_Context);
        Cy_SMIF_Enable(SMIF0_CORE, &SMIF_CORE0_Context);
    }
    #endif // (smif_0_mpc_0_REGION_COUNT > 0U)

    #if (smif_1_mpc_0_REGION_COUNT > 0U)
    bool isSmif1Uninitialized = false;
    if (!Cy_SMIF_IsEnabled(SMIF1_CORE)) {
        isSmif1Uninitialized = true;

        cy_stc_smif_context_t SMIF_CORE1_Context;

        static const cy_stc_smif_config_t SMIF_0_CORE_1_config =
        {
            .mode = (uint32_t)CY_SMIF_NORMAL,
            .deselectDelay = SMIF_DESELECT_DELAY,
            .blockEvent = (uint32_t)CY_SMIF_BUS_ERROR,
            .enable_internal_dll = false
        };

        /* Enable IP with default configuration */
        (void)Cy_SMIF_Init(SMIF1_CORE, &SMIF_0_CORE_1_config, TIMEOUT_1_MS, &SMIF_CORE1_Context);
        Cy_SMIF_Enable(SMIF1_CORE, &SMIF_CORE1_Context);
    }
    #endif // (smif_1_mpc_0_REGION_COUNT > 0U)

    #if (socmem_0_mpc_0_REGION_COUNT > 0U)
    /* Enable SOCMEM */
    Cy_SysEnableSOCMEM(true);
    #endif // (socmem_0_mpc_0_REGION_COUNT > 0U)

    for (size_t memory_idx = 0; memory_idx < cy_response_mpcs_count; memory_idx++)
    {
        Cy_Mpc_SetViolationResponse(cy_response_mpcs[memory_idx].base, cy_response_mpcs[memory_idx].response);
    }


    for (size_t domain_idx = 0; domain_idx < unified_mpc_domains_count; ++domain_idx)
    {
        const cy_stc_mpc_unified_t *domain = &unified_mpc_domains[domain_idx];

        for (uint32_t region_idx = 0; region_idx < domain->region_count; ++region_idx)
        {
            const cy_stc_mpc_regions_t *region = &domain->regions[region_idx];

            if (region->base == (MPC_Type *)RRAMC0_MPC0) {
                currentResult = _cycfg_mpc_init_regions_rram(region, &(domain->cfg[0]), domain->cfg_count);
            } else {
                // Check for an empty regions struct
                if (region->base != NULL) {
                    currentResult = _cycfg_mpc_init_regions(region, &(domain->cfg[0]), domain->cfg_count);
                }
            }

            if (CY_RSLT_SUCCESS != currentResult) {
                retResult = currentResult;
            }
        }
    }

    #if (smif_1_mpc_0_REGION_COUNT > 0U)
    if (isSmif1Uninitialized) {
        /* Disable IP as MPC configuration is complete*/
        Cy_SMIF_Disable(SMIF1_CORE);
    }
    #endif // (smif_1_mpc_0_REGION_COUNT > 0U)

    #if (smif_0_mpc_0_REGION_COUNT > 0U)
    if (isSmif0Uninitialized) {
        /* Disable IP as MPC configuration is complete*/
        Cy_SMIF_Disable(SMIF0_CORE);
    }
    #endif // (smif_0_mpc_0_REGION_COUNT > 0U)

    return retResult;
}
#endif /* defined(CY_PDL_TZ_ENABLED) */

cy_rslt_t cycfg_ppc_init_unsecure(PPC_Type *base, const cy_en_prot_region_t regions[], size_t count) {
    cy_rslt_t ret = Cy_Ppc_InitPpc(base, CY_PPC_BUS_ERR);

    for (size_t index = 0; ret == CY_PPC_SUCCESS && index < count; index++)
    {
        ret = Cy_Ppc_ConfigAttrib(base, regions[index], &cycfg_unused_ppc_cfg);
        if (ret == CY_RSLT_SUCCESS) {
            ret = Cy_Ppc_SetPcMask(base, regions[index], PPC_PC_MASK_ALL_ACCESS);
        }
    }
    return ret;
}
cy_rslt_t init_cycfg_ppc0(void) {
    return cycfg_ppc_init_unsecure(PPC0, cycfg_unused_ppc_0_regions, cycfg_unused_ppc_0_regions_count);
}
cy_rslt_t init_cycfg_ppc1(void) {
    return cycfg_ppc_init_unsecure(PPC1, cycfg_unused_ppc_1_regions, cycfg_unused_ppc_1_regions_count);
}
void init_cycfg_system(void) {
    #if defined(CY_CFG_PWR_ENABLED) && defined(CY_CFG_PWR_INIT)
    init_cycfg_power();
    #endif /* defined (CY_CFG_PWR_ENABLED) && defined (CY_CFG_PWR_INIT) */
}
